app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("pic_content_type", "created_at", "pic_updated_at", "updated_at", "pic_file_size", "pic_file_name") VALUES('image/jpeg', '2009-11-21 18:48:17', '2009-11-21 18:48:16', '2009-11-21 18:48:17', 74079, 'seahorse.jpg')
---
  def create
    p = Picture.new
    p.drawing = params[:Filedata]
    p.save